OpenFOAM-v1812/tutorials/multiphase/interFoam/RAS/damBreakPorousBaffle/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    leftWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    rightWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    lowerWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    atmosphere
    {
        type            totalPressure;
        rho             rho;
        psi             none;
        gamma           1;
        p0              uniform 0;
        value           uniform 0;
    }
    defaultFaces
    {
        type            empty;
    }
    porous_half0
    {
        type            porousBafflePressure;
        patchType       cyclic;
        D               242282;//1e3
        I               0.5;
        length          0.15;
        uniformJump     true;
        jump            uniform 0;
        value           uniform 0;
    }
    porous_half1
    {
        type            porousBafflePressure;
        patchType       cyclic;
        D               242282;
        I               0.5;//500
        length          0.15;//0.15
        uniformJump     true;
        jump            uniform 0;
        value           uniform 0;
    }
    //~ porous_half0
    //~ {
        //~ type            porousBafflePressure;
        //~ patchType       cyclic;
        //~ D               1e3;//
        //~ I               500;
        //~ length          0.15;
        //~ uniformJump     true;
        //~ jump            uniform 0;
        //~ value           uniform 0;
    //~ }
    //~ porous_half1
    //~ {
        //~ type            porousBafflePressure;
        //~ patchType       cyclic;
        //~ D               1e3;
        //~ I               500;//500
        //~ length          0.15;//0.15
        //~ uniformJump     true;
        //~ jump            uniform 0;
        //~ value           uniform 0;
    //~ }
}


// ************************************************************************* //
